hysonglet/platformio_synwit/misc/svd/SWM341.svd
<?xml version="1.0" encoding="UTF-8"?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>SWM341</name>
  <version>1.0</version>
  <description>SWM341 Microcontroller registers</description>
  <cpu>
    <name>CM0</name>
    <endian>little</endian>
    <revision>r1p0</revision>
    <nvicPrioBits>2</nvicPrioBits>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0</resetMask>
  <peripherals>
    <peripheral>
      <name>SYS</name>
      <description>Registers group</description>
      <groupName>SYS</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0AA09C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLKSEL</name>
          <description>CLKSEL register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYS</name>
              <description>SYS field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIVx</name>
              <description>CLK_DIVx field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK</name>
              <description>CLK field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOFILT</name>
              <description>IOFILT field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AD0</name>
              <description>AD0 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AD0DIV</name>
              <description>AD0DIV field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AD1</name>
              <description>AD1 field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AD1DIV</name>
              <description>AD1DIV field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>SLEEP field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIVx_ON</name>
          <description>CLKDIVx_ON register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CLKEN0</name>
          <description>CLKEN0 register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>GPIOA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>GPIOB field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>GPIOC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOD</name>
              <description>GPIOD field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOM</name>
              <description>GPIOM field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPION</name>
              <description>GPION field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3</name>
              <description>UART3 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR</name>
              <description>TIMR field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM</name>
              <description>PWM field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI0</name>
              <description>SPI0 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1</name>
              <description>SPI1 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>CRC field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORDIC</name>
              <description>CORDIC field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>DIV field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB</name>
              <description>USB field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAC</name>
              <description>ANAC field</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 field</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D</name>
              <description>DMA2D field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD</name>
              <description>LCD field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKEN1</name>
          <description>CLKEN1 register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOE</name>
              <description>GPIOE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2</name>
              <description>SPI2 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDRAM</name>
              <description>SDRAM field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFC</name>
              <description>SFC field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC1 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1</name>
              <description>CAN1 field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOFILT</name>
              <description>IOFILT field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIMR</name>
              <description>BTIMR field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG</name>
              <description>JPEG field</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC</name>
              <description>DAC field</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QEI</name>
              <description>QEI field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEP</name>
          <description>SLEEP register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>SLEEP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTSR</name>
          <description>RSTSR register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POR</name>
              <description>POR field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCWKCR</name>
          <description>RTCWKCR register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCWKSR</name>
          <description>RTCWKSR register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLAG</name>
              <description>FLAG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHYCR</name>
          <description>USBPHYCR register</description>
          <addressOffset>0x000070</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IDEN</name>
              <description>IDEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE</name>
              <description>OPMODE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR</name>
              <description>XCVR field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLEN</name>
              <description>PLLEN field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCR</name>
          <description>USBCR register</description>
          <addressOffset>0x000074</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RST48M</name>
              <description>RST48M field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST12M</name>
              <description>RST12M field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPLL</name>
              <description>RSTPLL field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROLE</name>
              <description>ROLE field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUS</name>
              <description>VBUS field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID[%s]</name>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <description>CHIPID register</description>
          <addressOffset>0x000080</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>BACKUP[%s]</name>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <description>BACKUP register</description>
          <addressOffset>0x000090</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PRNGCR</name>
          <description>PRNGCR register</description>
          <addressOffset>0x0000D0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLR</name>
              <description>CLR field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRNGDL</name>
          <description>PRNGDL register</description>
          <addressOffset>0x0000D4</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PRNGDH</name>
          <description>PRNGDH register</description>
          <addressOffset>0x0000D8</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PAWKEN</name>
          <description>PAWKEN register</description>
          <addressOffset>0x000100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PBWKEN</name>
          <description>PBWKEN register</description>
          <addressOffset>0x000104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PCWKEN</name>
          <description>PCWKEN register</description>
          <addressOffset>0x000108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PDWKEN</name>
          <description>PDWKEN register</description>
          <addressOffset>0x00010C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PEWKEN</name>
          <description>PEWKEN register</description>
          <addressOffset>0x000110</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PMWKEN</name>
          <description>PMWKEN register</description>
          <addressOffset>0x000120</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PNWKEN</name>
          <description>PNWKEN register</description>
          <addressOffset>0x000124</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PAWKSR</name>
          <description>PAWKSR register</description>
          <addressOffset>0x000130</addressOffset>
          <access>read-write</access>
        </register>
