hysonglet/platformio_synwit/misc/svd/SWM341.svd
        <register>
          <name>PBWKSR</name>
          <description>PBWKSR register</description>
          <addressOffset>0x000134</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PCWKSR</name>
          <description>PCWKSR register</description>
          <addressOffset>0x000138</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PDWKSR</name>
          <description>PDWKSR register</description>
          <addressOffset>0x00013C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PEWKSR</name>
          <description>PEWKSR register</description>
          <addressOffset>0x000140</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PMWKSR</name>
          <description>PMWKSR register</description>
          <addressOffset>0x000150</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PNWKSR</name>
          <description>PNWKSR register</description>
          <addressOffset>0x000154</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IOFILT0</name>
          <description>IOFILT0 register</description>
          <addressOffset>0x000400</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IOFILT1</name>
          <description>IOFILT1 register</description>
          <addressOffset>0x000404</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PRSTEN</name>
          <description>PRSTEN register</description>
          <addressOffset>0x000720</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PRSTR0</name>
          <description>PRSTR0 register</description>
          <addressOffset>0x000724</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>GPIOA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>GPIOB field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>GPIOC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOD</name>
              <description>GPIOD field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOM</name>
              <description>GPIOM field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPION</name>
              <description>GPION field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3</name>
              <description>UART3 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR</name>
              <description>TIMR field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM</name>
              <description>PWM field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI0</name>
              <description>SPI0 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1</name>
              <description>SPI1 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>CRC field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORDIC</name>
              <description>CORDIC field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>DIV field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB</name>
              <description>USB field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAC</name>
              <description>ANAC field</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 field</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D</name>
              <description>DMA2D field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD</name>
              <description>LCD field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTR1</name>
          <description>PRSTR1 register</description>
          <addressOffset>0x000728</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOE</name>
              <description>GPIOE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2</name>
              <description>SPI2 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDRAM</name>
              <description>SDRAM field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1</name>
              <description>ADC1 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOFILT</name>
              <description>IOFILT field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIMR</name>
              <description>BTIMR field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG</name>
              <description>JPEG field</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HRCCR</name>
          <description>HRCCR register</description>
          <addressOffset>0x0AA000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBL</name>
              <description>DBL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODCR</name>
          <description>BODCR register</description>
          <addressOffset>0x0AA010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IE</name>
              <description>IE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTLVL</name>
              <description>INTLVL field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTLVL</name>
              <description>RSTLVL field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODSR</name>
          <description>BODSR register</description>
          <addressOffset>0x0AA014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IF</name>
              <description>IF field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ST</name>
              <description>ST field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCR</name>
          <description>ADCCR register</description>
          <addressOffset>0x0AA018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_0IVREN</name>
              <description>_0IVREN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_1IVREN</name>
              <description>_1IVREN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_0IVRSEL</name>
              <description>_0IVRSEL field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_1IVRSEL</name>
              <description>_1IVRSEL field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IVRFLT</name>
              <description>IVRFLT field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IVROuA</name>
              <description>IVROuA field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IVRLVL</name>
              <description>IVRLVL field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IVRTRIM</name>
              <description>IVRTRIM field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALCR</name>
          <description>XTALCR register</description>
          <addressOffset>0x0AA020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_32KON</name>
              <description>_32KON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_32KDET</name>
              <description>_32KDET field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DET</name>
              <description>DET field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_32KDRV</name>
              <description>_32KDRV field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRV</name>
              <description>DRV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALSR</name>
          <description>XTALSR register</description>
          <addressOffset>0x0AA024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>_32KSTOP</name>
              <description>_32KSTOP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCR</name>
          <description>PLLCR register</description>
          <addressOffset>0x0AA040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OUTEN</name>
              <description>OUTEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL</name>
              <description>INSEL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFF</name>
              <description>OFF field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST</name>
              <description>RST field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLDIV</name>
          <description>PLLDIV register</description>
          <addressOffset>0x0AA044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FBDIV</name>
              <description>FBDIV field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDIV</name>
              <description>INDIV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDIV</name>
              <description>OUTDIV field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLLOCK</name>
          <description>PLLLOCK register</description>
          <addressOffset>0x0AA04C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>LRCCR</name>
          <description>LRCCR register</description>
          <addressOffset>0x0AA050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACR</name>
          <description>OPACR register</description>
          <addressOffset>0x0AA070</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OPA0ON</name>
              <description>OPA0ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA1ON</name>
              <description>OPA1ON field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA2ON</name>
              <description>OPA2ON field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA3ON</name>
              <description>OPA3ON field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
