hysonglet/platformio_synwit/misc/svd/SWM341.svd
        <register>
          <name>ACMPCR</name>
          <description>ACMPCR register</description>
          <addressOffset>0x0AA080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP0ON</name>
              <description>CMP0ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1ON</name>
              <description>CMP1ON field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2ON</name>
              <description>CMP2ON field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0HYS</name>
              <description>CMP0HYS field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1HYS</name>
              <description>CMP1HYS field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2HYS</name>
              <description>CMP2HYS field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_0NVREF</name>
              <description>_0NVREF field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_1NVREF</name>
              <description>_1NVREF field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_2NVREF</name>
              <description>_2NVREF field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0IE</name>
              <description>CMP0IE field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1IE</name>
              <description>CMP1IE field</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2IE</name>
              <description>CMP2IE field</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACMPSR</name>
          <description>ACMPSR register</description>
          <addressOffset>0x0AA084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP0OUT</name>
              <description>CMP0OUT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1OUT</name>
              <description>CMP1OUT field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2OUT</name>
              <description>CMP2OUT field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP0IF</name>
              <description>CMP0IF field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP1IF</name>
              <description>CMP1IF field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2IF</name>
              <description>CMP2IF field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACMPCR2</name>
          <description>ACMPCR2 register</description>
          <addressOffset>0x0AA088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRK0</name>
              <description>BRK0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK1</name>
              <description>BRK1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK2</name>
              <description>BRK2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF</name>
              <description>VREF field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACCR</name>
          <description>DACCR register</description>
          <addressOffset>0x0AA090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VRADJ</name>
              <description>VRADJ field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPCR</name>
          <description>TEMPCR register</description>
          <addressOffset>0x0AA098</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM</name>
              <description>TRIM field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AD0CH7</name>
              <description>AD0CH7 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
