hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR1</name>
      <baseAddress>0x40046840</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR2</name>
      <baseAddress>0x40046880</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR3</name>
      <baseAddress>0x400468C0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR4</name>
      <baseAddress>0x40046900</baseAddress>
    </peripheral>
    <peripheral>
      <name>TIMRG</name>
      <description>Registers group</description>
      <groupName>TIMRG</groupName>
      <baseAddress>0x40046C00</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000044</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HALLIE</name>
          <description>HALLIE register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HALL0</name>
              <description>HALL0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALL3</name>
              <description>HALL3 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HALLIF</name>
          <description>HALLIF register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>H0IN0</name>
              <description>H0IN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H0IN1</name>
              <description>H0IN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H0IN2</name>
              <description>H0IN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3IN0</name>
              <description>H3IN0 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3IN1</name>
              <description>H3IN1 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3IN2</name>
              <description>H3IN2 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HALLEN</name>
          <description>HALLEN register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HALL0</name>
              <description>HALL0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALL3</name>
              <description>HALL3 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HALL0V</name>
          <description>HALL0V register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HALL3V</name>
          <description>HALL3V register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HALLSR</name>
          <description>HALLSR register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>H0IN0</name>
              <description>H0IN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H0IN1</name>
              <description>H0IN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H0IN2</name>
              <description>H0IN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3IN0</name>
              <description>H3IN0 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3IN1</name>
              <description>H3IN1 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H3IN2</name>
              <description>H3IN2 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>EN register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMR0</name>
              <description>TIMR0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR1</name>
              <description>TIMR1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR2</name>
              <description>TIMR2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR3</name>
              <description>TIMR3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR4</name>
              <description>TIMR4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR5</name>
              <description>TIMR5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR6</name>
              <description>TIMR6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR7</name>
              <description>TIMR7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR8</name>
              <description>TIMR8 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR9</name>
              <description>TIMR9 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR10</name>
              <description>TIMR10 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR11</name>
              <description>TIMR11 field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
