hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI1</name>
      <baseAddress>0x40044800</baseAddress>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <description>Registers group</description>
      <groupName>I2C</groupName>
      <baseAddress>0x400A6000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000038</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASTER</name>
              <description>MASTER field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS</name>
              <description>HS field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNF</name>
              <description>DNF field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCL</name>
              <description>SCL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA</name>
              <description>SDA field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <description>TR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXACK</name>
              <description>TXACK field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXACK</name>
              <description>RXACK field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCLR</name>
              <description>TXCLR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVACT</name>
              <description>SLVACT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVRD</name>
              <description>SLVRD field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVWR</name>
              <description>SLVWR field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVSTR</name>
              <description>SLVSTR field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVRDS</name>
              <description>SLVRDS field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDATA</name>
          <description>RXDATA register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXDATA</name>
          <description>TXDATA register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXE</name>
              <description>TXE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>RXNE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOV</name>
              <description>RXOV field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDONE</name>
              <description>TXDONE field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDONE</name>
              <description>RXDONE field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTA</name>
              <description>RXSTA field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTO</name>
              <description>RXSTO field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AL</name>
              <description>AL field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLTO</name>
              <description>MLTO field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXE</name>
              <description>TXE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>RXNE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOV</name>
              <description>RXOV field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDONE</name>
              <description>TXDONE field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDONE</name>
              <description>RXDONE field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTA</name>
              <description>RXSTA field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTO</name>
              <description>RXSTO field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AL</name>
              <description>AL field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLTO</name>
              <description>MLTO field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <description>MCR register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>STA</name>
              <description>STA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD</name>
              <description>RD field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR</name>
              <description>WR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STO</name>
              <description>STO field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>CLK register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCLL</name>
              <description>SCLL field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLH</name>
              <description>SCLH field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>DIV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDAH</name>
              <description>SDAH field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>SCR register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR10</name>
              <description>ADDR10 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCDE</name>
              <description>MCDE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STRE</name>
              <description>STRE field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASDS</name>
              <description>ASDS field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR</name>
          <description>SADDR register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR7</name>
              <description>ADDR7 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK7</name>
              <description>MASK7 field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
