hysonglet/platformio_synwit/misc/svd/SWM341.svd
        <cluster>
          <name>SEQ2</name>
          <description>register cluster</description>
          <addressOffset>0x000030</addressOffset>
          <register>
            <name>SR</name>
            <description>SR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>EOC</name>
                <description>EOC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF</name>
                <description>OVF field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HALF</name>
                <description>HALF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FULL</name>
                <description>FULL field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EMPTY</name>
                <description>EMPTY field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LEVEL</name>
                <description>LEVEL field</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DR</name>
            <description>DR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VALUE</name>
                <description>VALUE field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHNUM</name>
                <description>CHNUM field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMP</name>
            <description>CMP register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAX</name>
                <description>MAX field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MIN</name>
                <description>MIN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SEQ3</name>
          <description>register cluster</description>
          <addressOffset>0x000040</addressOffset>
          <register>
            <name>SR</name>
            <description>SR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>EOC</name>
                <description>EOC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF</name>
                <description>OVF field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HALF</name>
                <description>HALF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FULL</name>
                <description>FULL field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EMPTY</name>
                <description>EMPTY field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LEVEL</name>
                <description>LEVEL field</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DR</name>
            <description>DR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VALUE</name>
                <description>VALUE field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHNUM</name>
                <description>CHNUM field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMP</name>
            <description>CMP register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MAX</name>
                <description>MAX field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MIN</name>
                <description>MIN field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SEQCHN0</name>
          <description>SEQCHN0 register</description>
          <addressOffset>0x00008C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ0</name>
              <description>SEQ0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1</name>
              <description>SEQ1 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCHN1</name>
          <description>SEQCHN1 register</description>
          <addressOffset>0x000090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ2</name>
              <description>SEQ2 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ3</name>
              <description>SEQ3 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQTRG</name>
          <description>SEQTRG register</description>
          <addressOffset>0x000094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ0</name>
              <description>SEQ0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1</name>
              <description>SEQ1 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ2</name>
              <description>SEQ2 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ3</name>
              <description>SEQ3 field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCOV</name>
          <description>SEQCOV register</description>
          <addressOffset>0x000098</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ0</name>
              <description>SEQ0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1</name>
              <description>SEQ1 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ2</name>
              <description>SEQ2 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ3</name>
              <description>SEQ3 field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQSMP</name>
          <description>SEQSMP register</description>
          <addressOffset>0x00009C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ0</name>
              <description>SEQ0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1</name>
              <description>SEQ1 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ2</name>
              <description>SEQ2 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ3</name>
              <description>SEQ3 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>CR2 register</description>
          <addressOffset>0x0000B0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENLDO</name>
              <description>ENLDO field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITS</name>
              <description>BITS field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIB</name>
          <description>CALIB register</description>
          <addressOffset>0x0000F0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>RESET field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>START field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>LOAD field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>BYPASS field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>RESULT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
