hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40049800</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>Registers group</description>
      <groupName>PWM</groupName>
      <baseAddress>0x40046000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000080</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT</name>
              <description>MULT field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLKSRC field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPTNUM</name>
              <description>RPTNUM field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR</name>
          <description>OCR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IDLEA</name>
              <description>IDLEA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEB</name>
              <description>IDLEB field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEAN</name>
              <description>IDLEAN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEBN</name>
              <description>IDLEBN field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVA</name>
              <description>INVA field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVB</name>
              <description>INVB field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVAN</name>
              <description>INVAN field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVBN</name>
              <description>INVBN field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRKCR</name>
          <description>BRKCR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OUTA</name>
              <description>OUTA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFA</name>
              <description>OFFA field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTB</name>
              <description>OUTB field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFB</name>
              <description>OFFB field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTAN</name>
              <description>OUTAN field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTBN</name>
              <description>OUTBN field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STPCNT</name>
              <description>STPCNT field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>ACTIVE field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRKIN</name>
          <description>BRKIN register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRK0A</name>
              <description>BRK0A field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK1A</name>
              <description>BRK1A field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK2A</name>
              <description>BRK2A field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK0B</name>
              <description>BRK0B field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK1B</name>
              <description>BRK1B field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK2B</name>
              <description>BRK2B field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERIOD</name>
          <description>PERIOD register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CMPA</name>
          <description>CMPA register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CMPB</name>
          <description>CMPB register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DZA</name>
          <description>DZA register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DZB</name>
          <description>DZB register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CMPA2</name>
          <description>CMPA2 register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CMPB2</name>
          <description>CMPB2 register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>OVFTRG</name>
          <description>OVFTRG register</description>
          <addressOffset>0x000050</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPEN</name>
              <description>UPEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNEN</name>
              <description>DNEN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX</name>
              <description>MUX field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPTRG</name>
          <description>CMPTRG register</description>
          <addressOffset>0x000054</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMP</name>
              <description>CMP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX</name>
              <description>MUX field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIDTH</name>
              <description>WIDTH field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATP</name>
              <description>ATP field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVMUX</name>
          <description>EVMUX register</description>
          <addressOffset>0x000060</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>START field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE</name>
              <description>PAUSE field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RELOAD</name>
              <description>RELOAD field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASKA</name>
              <description>MASKA field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASKB</name>
              <description>MASKB field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASKAN</name>
              <description>MASKAN field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASKBN</name>
              <description>MASKBN field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVMSK</name>
          <description>EVMSK register</description>
          <addressOffset>0x000064</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OUTA</name>
              <description>OUTA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTB</name>
              <description>OUTB field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTAN</name>
              <description>OUTAN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTBN</name>
              <description>OUTBN field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMME</name>
              <description>IMME field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STPCLR</name>
              <description>STPCLR field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000070</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPOVF</name>
              <description>UPOVF field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNOVF</name>
              <description>DNOVF field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPCMPA</name>
              <description>UPCMPA field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPCMPB</name>
              <description>UPCMPB field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNCMPA</name>
              <description>DNCMPA field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNCMPB</name>
              <description>DNCMPB field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000074</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>UPOVF</name>
              <description>UPOVF field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNOVF</name>
              <description>DNOVF field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPCMPA</name>
              <description>UPCMPA field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPCMPB</name>
              <description>UPCMPB field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNCMPA</name>
              <description>DNCMPA field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DNCMPB</name>
              <description>DNCMPB field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>VALUE register</description>
          <addressOffset>0x000078</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x00007C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTA</name>
              <description>OUTA field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTB</name>
              <description>OUTB field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTAN</name>
              <description>OUTAN field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTBN</name>
              <description>OUTBN field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
