hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN0</name>
      <description>Registers group</description>
      <groupName>CAN</groupName>
      <baseAddress>0x400A8000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0003C0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RST</name>
              <description>RST field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOM</name>
              <description>LOM field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STM</name>
              <description>STM field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>SLEEP field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>CMD register</description>
          <addressOffset>0x000004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXREQ</name>
              <description>TXREQ field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ABTTX</name>
              <description>ABTTX field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RRB</name>
              <description>RRB field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CLROV</name>
              <description>CLROV field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRR</name>
              <description>SRR field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXDA</name>
              <description>RXDA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXOV</name>
              <description>RXOV field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBR</name>
              <description>TXBR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXOK</name>
              <description>TXOK field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXBUSY</name>
              <description>RXBUSY field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBUSY</name>
              <description>TXBUSY field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRWARN</name>
              <description>ERRWARN field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSOFF</name>
              <description>BUSOFF field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXDA</name>
              <description>RXDA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBR</name>
              <description>TXBR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWARN</name>
              <description>ERRWARN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOV</name>
              <description>RXOV field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>WKUP field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRPASS</name>
              <description>ERRPASS field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLOST</name>
              <description>ARBLOST field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>BUSERR field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXDA</name>
              <description>RXDA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBR</name>
              <description>TXBR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRWARN</name>
              <description>ERRWARN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOV</name>
              <description>RXOV field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP</name>
              <description>WKUP field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRPASS</name>
              <description>ERRPASS field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBLOST</name>
              <description>ARBLOST field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>BUSERR field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT2</name>
          <description>BT2 register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT0</name>
          <description>BT0 register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SJW</name>
              <description>SJW field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT1</name>
          <description>BT1 register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TSEG1</name>
              <description>TSEG1 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEG2</name>
              <description>TSEG2 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAM</name>
              <description>SAM field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFM</name>
          <description>AFM register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>AFE</name>
          <description>AFE register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ALC</name>
          <description>ALC register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>ECC</name>
          <description>ECC register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SEGCODE</name>
              <description>SEGCODE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRCODE</name>
              <description>ERRCODE field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EWLIM</name>
          <description>EWLIM register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RXERR</name>
          <description>RXERR register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXERR</name>
          <description>TXERR register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-write</access>
        </register>
        <cluster>
          <name>FRAME</name>
          <description>register cluster</description>
          <addressOffset>0x000040</addressOffset>
          <register>
            <name>INFO</name>
            <description>INFO register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DLC</name>
                <description>DLC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RTR</name>
                <description>RTR field</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FF</name>
                <description>FF field</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA[%s]</name>
            <dim>12</dim>
            <dimIncrement>4</dimIncrement>
            <description>DATA register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <register>
          <name>RMCNT</name>
          <description>RMCNT register</description>
          <addressOffset>0x000074</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>ACR[%s]</name>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <description>ACR register</description>
          <addressOffset>0x000300</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>AMR[%s]</name>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <description>AMR register</description>
          <addressOffset>0x000380</addressOffset>
          <access>read-write</access>
        </register>
