hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x400A8800</baseAddress>
    </peripheral>
    <peripheral>
      <name>USBD</name>
      <description>Registers group</description>
      <groupName>USBD</groupName>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x004844</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TXBUF0_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF0_ register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF1_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF1_ register</description>
          <addressOffset>0x000400</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF2_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF2_ register</description>
          <addressOffset>0x000800</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF3_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF3_ register</description>
          <addressOffset>0x000C00</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF4_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF4_ register</description>
          <addressOffset>0x001000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF5_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF5_ register</description>
          <addressOffset>0x001400</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF6_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF6_ register</description>
          <addressOffset>0x001800</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF7_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF7_ register</description>
          <addressOffset>0x001C00</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF8_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF8_ register</description>
          <addressOffset>0x002000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF9_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF9_ register</description>
          <addressOffset>0x002400</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF10_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF10_ register</description>
          <addressOffset>0x002800</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF11_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF11_ register</description>
          <addressOffset>0x002C00</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF12_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF12_ register</description>
          <addressOffset>0x003000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF13_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF13_ register</description>
          <addressOffset>0x003400</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF14_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF14_ register</description>
          <addressOffset>0x003800</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TXBUF15_[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF15_ register</description>
          <addressOffset>0x003C00</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RXBUF[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>RXBUF register</description>
          <addressOffset>0x004000</addressOffset>
          <access>read-write</access>
        </register>
        <cluster>
          <name>INEP0</name>
          <description>register cluster</description>
          <addressOffset>0x004400</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP1</name>
          <description>register cluster</description>
          <addressOffset>0x004410</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP2</name>
          <description>register cluster</description>
          <addressOffset>0x004420</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP3</name>
          <description>register cluster</description>
          <addressOffset>0x004430</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP4</name>
          <description>register cluster</description>
          <addressOffset>0x004440</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP5</name>
          <description>register cluster</description>
          <addressOffset>0x004450</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP6</name>
          <description>register cluster</description>
          <addressOffset>0x004460</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
