hysonglet/platformio_synwit/misc/svd/SWM341.svd
        <cluster>
          <name>INEP7</name>
          <description>register cluster</description>
          <addressOffset>0x004470</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP8</name>
          <description>register cluster</description>
          <addressOffset>0x004480</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP9</name>
          <description>register cluster</description>
          <addressOffset>0x004490</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP10</name>
          <description>register cluster</description>
          <addressOffset>0x0044A0</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP11</name>
          <description>register cluster</description>
          <addressOffset>0x0044B0</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP12</name>
          <description>register cluster</description>
          <addressOffset>0x0044C0</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP13</name>
          <description>register cluster</description>
          <addressOffset>0x0044D0</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP14</name>
          <description>register cluster</description>
          <addressOffset>0x0044E0</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>INEP15</name>
          <description>register cluster</description>
          <addressOffset>0x0044F0</addressOffset>
          <register>
            <name>TXCR</name>
            <description>TXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSR</name>
            <description>TXSR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SUCC</name>
                <description>SUCC field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATSNT</name>
                <description>DATSNT field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NAKSNT</name>
                <description>NAKSNT field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXTRSZ</name>
            <description>TXTRSZ register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
