hysonglet/platformio_synwit/misc/svd/SWM341.svd
        <cluster>
          <name>OUTEP0</name>
          <description>register cluster</description>
          <addressOffset>0x004500</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP1</name>
          <description>register cluster</description>
          <addressOffset>0x004510</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP2</name>
          <description>register cluster</description>
          <addressOffset>0x004520</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP3</name>
          <description>register cluster</description>
          <addressOffset>0x004530</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP4</name>
          <description>register cluster</description>
          <addressOffset>0x004540</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP5</name>
          <description>register cluster</description>
          <addressOffset>0x004550</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP6</name>
          <description>register cluster</description>
          <addressOffset>0x004560</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP7</name>
          <description>register cluster</description>
          <addressOffset>0x004570</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP8</name>
          <description>register cluster</description>
          <addressOffset>0x004580</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP9</name>
          <description>register cluster</description>
          <addressOffset>0x004590</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP10</name>
          <description>register cluster</description>
          <addressOffset>0x0045A0</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP11</name>
          <description>register cluster</description>
          <addressOffset>0x0045B0</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP12</name>
          <description>register cluster</description>
          <addressOffset>0x0045C0</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP13</name>
          <description>register cluster</description>
          <addressOffset>0x0045D0</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP14</name>
          <description>register cluster</description>
          <addressOffset>0x0045E0</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUTEP15</name>
          <description>register cluster</description>
          <addressOffset>0x0045F0</addressOffset>
          <register>
            <name>RXCR</name>
            <description>RXCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>SNDSTALL</name>
                <description>SNDSTALL field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FLUSHFF</name>
                <description>FLUSHFF field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFRDY</name>
                <description>FFRDY field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DEVCR</name>
          <description>DEVCR register</description>
          <addressOffset>0x004600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPEED</name>
              <description>SPEED field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMOTEWKUP</name>
              <description>REMOTEWKUP field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELFPWRD</name>
              <description>SELFPWRD field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCFRAME</name>
              <description>SYNCFRAME field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSRDONE</name>
              <description>CSRDONE field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETDESC</name>
              <description>SETDESC field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVICE</name>
              <description>DEVICE field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVSR</name>
          <description>DEVSR register</description>
          <addressOffset>0x004604</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CFG</name>
              <description>CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTF</name>
              <description>INTF field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALT</name>
              <description>ALT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>SUSP field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRNR</name>
              <description>FRNR field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
