hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBH</name>
      <alternatePeripheral>USBD</alternatePeripheral>
      <description>Registers group</description>
      <groupName>USBH</groupName>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x005098</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TXBUF[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>TXBUF register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RXBUF[%s]</name>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <description>RXBUF register</description>
          <addressOffset>0x004000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x004C00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXSTAT</name>
              <description>RXSTAT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABVTHR</name>
              <description>ABVTHR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLWTHR</name>
              <description>BLWTHR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF</name>
              <description>SOF field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT</name>
              <description>PORT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG</name>
              <description>OTG field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x004C04</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXSTAT</name>
              <description>RXSTAT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABVTHR</name>
              <description>ABVTHR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLWTHR</name>
              <description>BLWTHR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF</name>
              <description>SOF field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORT</name>
              <description>PORT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG</name>
              <description>OTG field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x004C08</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESP</name>
              <description>RESP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRSZ</name>
              <description>TRSZ field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x004C0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLUSHFF</name>
              <description>FLUSHFF field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FFSZ</name>
          <description>FFSZ register</description>
          <addressOffset>0x004C10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RX</name>
              <description>RX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX</name>
              <description>TX field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FFTHR</name>
          <description>FFTHR register</description>
          <addressOffset>0x004C14</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX</name>
              <description>TX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX</name>
              <description>RX field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTRSZ</name>
          <description>TXTRSZ register</description>
          <addressOffset>0x004C18</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>FRAMEIV</name>
          <description>FRAMEIV register</description>
          <addressOffset>0x005034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>FRAMERM</name>
          <description>FRAMERM register</description>
          <addressOffset>0x005038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>FRAMENR</name>
          <description>FRAMENR register</description>
          <addressOffset>0x00503C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PORTSR</name>
          <description>PORTSR register</description>
          <addressOffset>0x005054</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONN</name>
              <description>CONN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENA</name>
              <description>ENA field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>SUSP field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRSUSP</name>
              <description>CLRSUSP field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER</name>
              <description>POWER field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>SPEED field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONNCHG</name>
              <description>CONNCHG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENACHG</name>
              <description>ENACHG field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPCHG</name>
              <description>SUSPCHG field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTCHG</name>
              <description>RSTCHG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOKEN</name>
          <description>TOKEN register</description>
          <addressOffset>0x005090</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPNR</name>
              <description>EPNR field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAX</name>
              <description>DATAX field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>TYPE field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO</name>
              <description>ISO field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>SPEED field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRSZ</name>
              <description>TRSZ field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTGCSR</name>
          <description>OTGCSR register</description>
          <addressOffset>0x005094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRSUCC</name>
              <description>SRSUCC field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRSCHG</name>
              <description>SRSCHG field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNSUCC</name>
              <description>HNSUCC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNSCHG</name>
              <description>HNSCHG field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRDET</name>
              <description>SRDET field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRDCHG</name>
              <description>SRDCHG field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNDET</name>
              <description>HNDET field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNDCHG</name>
              <description>HNDCHG field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID</name>
              <description>ID field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDCHG</name>
              <description>IDCHG field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRPREQ</name>
              <description>SRPREQ field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNPREQ</name>
              <description>HNPREQ field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HHNPENA</name>
              <description>HHNPENA field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNPENA</name>
              <description>HNPENA field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRPCAP</name>
              <description>SRPCAP field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNPCAP</name>
              <description>HNPCAP field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
