hysonglet/platformio_synwit/misc/svd/SWM341.svd
          <register>
            <name>MUX</name>
            <description>MUX register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTHSSIG</name>
                <description>DSTHSSIG field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTHSEN</name>
                <description>DSTHSEN field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCHSSIG</name>
                <description>SRCHSSIG field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCHSEN</name>
                <description>SRCHSEN field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSSIG</name>
                <description>EXTHSSIG field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSEN</name>
                <description>EXTHSEN field</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSR</name>
            <description>DSTSR register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERR</name>
                <description>ERR field</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCSR</name>
            <description>SRCSR register</description>
            <addressOffset>0x000030</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERR</name>
                <description>ERR field</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CH2</name>
          <description>register cluster</description>
          <addressOffset>0x0000C0</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STEPOP</name>
                <description>STEPOP field</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBIT</name>
                <description>DSTBIT field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBURST</name>
                <description>DSTBURST field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBIT</name>
                <description>SRCBIT field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBURST</name>
                <description>SRCBURST field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>MUX</name>
            <description>MUX register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTHSSIG</name>
                <description>DSTHSSIG field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTHSEN</name>
                <description>DSTHSEN field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCHSSIG</name>
                <description>SRCHSSIG field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCHSEN</name>
                <description>SRCHSEN field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSSIG</name>
                <description>EXTHSSIG field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSEN</name>
                <description>EXTHSEN field</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSR</name>
            <description>DSTSR register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERR</name>
                <description>ERR field</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCSR</name>
            <description>SRCSR register</description>
            <addressOffset>0x000030</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERR</name>
                <description>ERR field</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CH3</name>
          <description>register cluster</description>
          <addressOffset>0x000100</addressOffset>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXEN</name>
                <description>RXEN field</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXEN</name>
                <description>TXEN field</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTORE</name>
                <description>AUTORE field</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STEPOP</name>
                <description>STEPOP field</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AM</name>
            <description>AM register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTAM</name>
                <description>DSTAM field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBIT</name>
                <description>DSTBIT field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTBURST</name>
                <description>DSTBURST field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCAM</name>
                <description>SRCAM field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBIT</name>
                <description>SRCBIT field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCBURST</name>
                <description>SRCBURST field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>DST register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR1</name>
            <description>DSTSGADDR1 register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR2</name>
            <description>DSTSGADDR2 register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSGADDR3</name>
            <description>DSTSGADDR3 register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>MUX</name>
            <description>MUX register</description>
            <addressOffset>0x000018</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>DSTHSSIG</name>
                <description>DSTHSSIG field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSTHSEN</name>
                <description>DSTHSEN field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCHSSIG</name>
                <description>SRCHSSIG field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SRCHSEN</name>
                <description>SRCHSEN field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSSIG</name>
                <description>EXTHSSIG field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSEN</name>
                <description>EXTHSEN field</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>SRC register</description>
            <addressOffset>0x00001C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR1</name>
            <description>SRCSGADDR1 register</description>
            <addressOffset>0x000020</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR2</name>
            <description>SRCSGADDR2 register</description>
            <addressOffset>0x000024</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>SRCSGADDR3</name>
            <description>SRCSGADDR3 register</description>
            <addressOffset>0x000028</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>DSTSR</name>
            <description>DSTSR register</description>
            <addressOffset>0x00002C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERR</name>
                <description>ERR field</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCSR</name>
            <description>SRCSR register</description>
            <addressOffset>0x000030</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERR</name>
                <description>ERR field</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
