hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>Registers group</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000044</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>START field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT</name>
              <description>WAIT field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>L0</name>
          <description>register cluster</description>
          <addressOffset>0x000010</addressOffset>
          <register>
            <name>MAR</name>
            <description>MAR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>OR</name>
            <description>OR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>PFCCR</name>
            <description>PFCCR register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CFMT</name>
                <description>CFMT field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AINV</name>
                <description>AINV field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RBSWAP</name>
                <description>RBSWAP field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>ALPHA field</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COLOR</name>
            <description>COLOR register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>L1</name>
          <description>register cluster</description>
          <addressOffset>0x000020</addressOffset>
          <register>
            <name>MAR</name>
            <description>MAR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>OR</name>
            <description>OR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>PFCCR</name>
            <description>PFCCR register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CFMT</name>
                <description>CFMT field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AINV</name>
                <description>AINV field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RBSWAP</name>
                <description>RBSWAP field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>ALPHA field</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COLOR</name>
            <description>COLOR register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>L2</name>
          <description>register cluster</description>
          <addressOffset>0x000030</addressOffset>
          <register>
            <name>MAR</name>
            <description>MAR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>OR</name>
            <description>OR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>PFCCR</name>
            <description>PFCCR register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>CFMT</name>
                <description>CFMT field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AINV</name>
                <description>AINV field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RBSWAP</name>
                <description>RBSWAP field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>ALPHA field</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COLOR</name>
            <description>COLOR register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <register>
          <name>NLR</name>
          <description>NLR register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>NLINE</name>
              <description>NLINE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPIXEL</name>
              <description>NPIXEL field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
