hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>Registers group</description>
      <groupName>DAC</groupName>
      <baseAddress>0x4004C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000010</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DHRFMT</name>
              <description>DHRFMT field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DHRFULL</name>
              <description>DHRFULL field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRG</name>
          <description>SWTRG register</description>
          <addressOffset>0x000008</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>DHR</name>
          <description>DHR register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>Registers group</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000010</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREV</name>
              <description>IREV field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INOT</name>
              <description>INOT field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OREV</name>
              <description>OREV field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONOT</name>
              <description>ONOT field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLY</name>
              <description>POLY field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIT</name>
              <description>IBIT field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAIN</name>
          <description>DATAIN register</description>
          <addressOffset>0x000004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>INIVAL</name>
          <description>INIVAL register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RESULT</name>
          <description>RESULT register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <description>Registers group</description>
      <groupName>CORDIC</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000020</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMD</name>
          <description>CMD register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>START field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANGE</name>
              <description>RANGE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINCOS</name>
              <description>SINCOS field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULDIV</name>
              <description>MULDIV field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT</name>
          <description>INPUT register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>F</name>
              <description>F field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>I field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F2</name>
              <description>F2 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2</name>
              <description>I2 field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COS</name>
          <description>COS register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>F</name>
              <description>F field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>I field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIN</name>
          <description>SIN register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>F</name>
              <description>F field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>I field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARCTAN</name>
          <description>ARCTAN register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>F</name>
              <description>F field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>I field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TANH</name>
          <description>TANH register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>F</name>
              <description>F field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>I field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
