hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC</name>
      <description>Registers group</description>
      <groupName>FMC</groupName>
      <baseAddress>0x4004A000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000028</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <description>DATA register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADDR</name>
          <description>ADDR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ERASE</name>
          <description>ERASE register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ</name>
              <description>REQ field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE</name>
          <description>CACHE register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROGEN</name>
              <description>PROGEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEN</name>
              <description>CEN field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPEN</name>
              <description>CPEN field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLR</name>
              <description>CCLR field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG0</name>
          <description>CFG0 register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG1</name>
          <description>CFG1 register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG2</name>
          <description>CFG2 register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG3</name>
          <description>CFG3 register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CFG4</name>
          <description>CFG4 register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>STAT</name>
          <description>STAT register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASEBUSY</name>
              <description>ERASEBUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROGBUSY</name>
              <description>PROGBUSY field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READBUSY</name>
              <description>READBUSY field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>FIFOEMPTY field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>FIFOFULL field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SFC</name>
      <description>Registers group</description>
      <groupName>SFC</groupName>
      <baseAddress>0x4004A800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000028</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <description>CFG register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDTYPE</name>
              <description>CMDTYPE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDWREN</name>
              <description>CMDWREN field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR4L</name>
              <description>ADDR4L field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA4L_PP</name>
              <description>DATA4L_PP field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA4L_RD</name>
              <description>DATA4L_RD field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WREN</name>
              <description>WREN field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM</name>
          <description>TIM register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIP_CHK_ITV</name>
              <description>WIP_CHK_ITV field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIP_CHK_LMT</name>
              <description>WIP_CHK_LMT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLETO</name>
              <description>IDLETO field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSHIGH</name>
              <description>CSHIGH field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOLVL</name>
              <description>FIFOLVL field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>FIFOEMPTY field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOHFULL</name>
              <description>FIFOHFULL field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>FIFOFULL field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOOVF</name>
              <description>FIFOOVF field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOUVF</name>
              <description>FIFOUVF field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVER</name>
              <description>OVER field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TO</name>
              <description>TO field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>FIFOEMPTY field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOHFULL</name>
              <description>FIFOHFULL field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>FIFOFULL field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOOVF</name>
              <description>FIFOOVF field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOUVF</name>
              <description>FIFOUVF field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVER</name>
              <description>OVER field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TO</name>
              <description>TO field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>FIFOEMPTY field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOHFULL</name>
              <description>FIFOHFULL field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOFULL</name>
              <description>FIFOFULL field</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOOVF</name>
              <description>FIFOOVF field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOUVF</name>
              <description>FIFOUVF field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GO</name>
          <description>GO register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADDR</name>
          <description>ADDR register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CMDAHB</name>
          <description>CMDAHB register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WREN</name>
              <description>WREN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PP</name>
              <description>PP field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDSRL</name>
              <description>RDSRL field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ</name>
              <description>READ field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>CMD register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
