hysonglet/platformio_synwit/misc/svd/SWM341.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JPEG</name>
      <description>Registers group</description>
      <groupName>JPEG</groupName>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFG</name>
          <description>CFG register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCFMT</name>
              <description>SRCFMT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANMOD</name>
              <description>SCANMOD field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NISCOMP</name>
              <description>NISCOMP field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HT1COMP</name>
              <description>HT1COMP field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HT2COMP</name>
              <description>HT2COMP field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HT3COMP</name>
              <description>HT3COMP field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QT1COMP</name>
              <description>QT1COMP field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QT2COMP</name>
              <description>QT2COMP field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QT3COMP</name>
              <description>QT3COMP field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFMT</name>
              <description>OUTFMT field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV2RGB</name>
              <description>YUV2RGB field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UVSWAP</name>
              <description>UVSWAP field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBSWAP</name>
              <description>RBSWAP field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDSWAP</name>
              <description>EDSWAP field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_565DITH</name>
              <description>_565DITH field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>START field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTART</name>
              <description>RESTART field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REINTRV</name>
              <description>REINTRV field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LASTBUF</name>
              <description>LASTBUF field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTAUTO</name>
              <description>QTAUTO field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HTAUTO</name>
              <description>HTAUTO field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTCNT</name>
              <description>QTCNT field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HTCNT</name>
              <description>HTCNT field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUCNT</name>
              <description>CUCNT field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IR</name>
          <description>IR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEDONE</name>
              <description>IEDONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEMPTY</name>
              <description>IEEMPTY field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IEERROR</name>
              <description>IEERROR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICDONE</name>
              <description>ICDONE field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEMPTY</name>
              <description>ICEMPTY field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICERROR</name>
              <description>ICERROR field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFDONE</name>
              <description>IFDONE field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFEMPTY</name>
              <description>IFEMPTY field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFERROR</name>
              <description>IFERROR field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUOVR</name>
              <description>CUOVR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REIMERR</name>
              <description>REIMERR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFBUSY</name>
              <description>BUFBUSY field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARDBUSY</name>
              <description>DMARDBUSY field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAWRBUSY</name>
              <description>DMAWRBUSY field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMGSIZ</name>
          <description>IMGSIZ register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HPIX</name>
              <description>HPIX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VPIX</name>
              <description>VPIX field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMGSTR</name>
          <description>IMGSTR register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RGBLINE</name>
              <description>RGBLINE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UVLINE</name>
              <description>UVLINE field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSBASE</name>
          <description>CSBASE register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>YBASE</name>
          <description>YBASE register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RGBASE</name>
          <alternateRegister>YBASE</alternateRegister>
          <description>RGBASE register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>UBASE</name>
          <description>UBASE register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>VBASE</name>
          <description>VBASE register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>QTBASE</name>
          <description>QTBASE register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HTBASE</name>
          <description>HTBASE register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CODLEN</name>
          <description>CODLEN register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>QTABLE0_[%s]</name>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <description>QTABLE0_ register</description>
          <addressOffset>0x000100</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>QTABLE1_[%s]</name>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <description>QTABLE1_ register</description>
          <addressOffset>0x000140</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>QTABLE2_[%s]</name>
          <dim>16</dim>
          <dimIncrement>4</dimIncrement>
          <description>QTABLE2_ register</description>
          <addressOffset>0x000180</addressOffset>
          <access>write-only</access>
        </register>
        <cluster>
          <name>HTABLE0</name>
          <description>register cluster</description>
          <addressOffset>0x000200</addressOffset>
          <register>
            <name>DC_CODEWORD[%s]</name>
            <dim>6</dim>
            <dimIncrement>4</dimIncrement>
            <description>DC_CODEWORD register</description>
            <addressOffset>0x000000</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>DC_CODELEN[%s]</name>
            <dim>2</dim>
            <dimIncrement>4</dimIncrement>
            <description>DC_CODELEN register</description>
            <addressOffset>0x000018</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>DC_CODEVAL[%s]</name>
            <dim>2</dim>
            <dimIncrement>4</dimIncrement>
            <description>DC_CODEVAL register</description>
            <addressOffset>0x000020</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>AC_CODEWORD[%s]</name>
            <dim>8</dim>
            <dimIncrement>4</dimIncrement>
            <description>AC_CODEWORD register</description>
            <addressOffset>0x000028</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>AC_CODEADDR[%s]</name>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <description>AC_CODEADDR register</description>
            <addressOffset>0x000048</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>AC_CODEVAL[%s]</name>
            <dim>41</dim>
            <dimIncrement>4</dimIncrement>
            <description>AC_CODEVAL register</description>
            <addressOffset>0x000058</addressOffset>
            <access>write-only</access>
          </register>
        </cluster>
        <cluster>
          <name>HTABLE1</name>
          <description>register cluster</description>
          <addressOffset>0x000300</addressOffset>
          <register>
            <name>DC_CODEWORD[%s]</name>
            <dim>6</dim>
            <dimIncrement>4</dimIncrement>
            <description>DC_CODEWORD register</description>
            <addressOffset>0x000000</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>DC_CODELEN[%s]</name>
            <dim>2</dim>
            <dimIncrement>4</dimIncrement>
            <description>DC_CODELEN register</description>
            <addressOffset>0x000018</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>DC_CODEVAL[%s]</name>
            <dim>2</dim>
            <dimIncrement>4</dimIncrement>
            <description>DC_CODEVAL register</description>
            <addressOffset>0x000020</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>AC_CODEWORD[%s]</name>
            <dim>8</dim>
            <dimIncrement>4</dimIncrement>
            <description>AC_CODEWORD register</description>
            <addressOffset>0x000028</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>AC_CODEADDR[%s]</name>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <description>AC_CODEADDR register</description>
            <addressOffset>0x000048</addressOffset>
            <access>write-only</access>
          </register>
          <register>
            <name>AC_CODEVAL[%s]</name>
            <dim>41</dim>
            <dimIncrement>4</dimIncrement>
            <description>AC_CODEVAL register</description>
            <addressOffset>0x000058</addressOffset>
            <access>write-only</access>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>
